In [2]:
# listの分割（split）
"""
split関数
    - 文字列を空白やスラッシュなどで分けたい時
文字列.split('区切る文字', 区切る回数)
"""
self_data = 'My name is Nemoto'

str_list = self_data.split(' ')
print(str_list)

['My', 'name', 'is', 'Nemoto']

In [3]:
print(str_list[3])

Nemoto

In [4]:
# listの分割（re.split）
"""
re.split
    - 一度に複数の記号で文字列を切り分ける
re.split(['区切りたい記号'], 文字列)
"""
import re

time_data = '2018/2/26_18:00'
time_list = re.split('[/_:]', time_data)
print(time_list)

['2018', '2', '26', '18', '00']

In [5]:
print(time_list[2])

26

In [7]:
# 高階関数（map）
"""
他の関数を引数とする関数
イテレータを返す 計算はしない
    - map(適用したい関数, 配列)
listに格納する方法
    - list(map(関数, 配列))
"""
import re

time_list = [
    "2006/11/26_2:40",
    "2009/1/16_23:35",
    "2014/5/4_14:26",
    "2017/8/9_7:5",
    "2017/4/1_22:15"
]

get_hour = lambda x: int(re.split('[/_:]', x)[3])

In [8]:
print(get_hour)

<function <lambda> at 0x10ebd8950>

In [9]:
hour_list = list(map(get_hour, time_list))
print(hour_list)

[2, 23, 14, 7, 22]

In [12]:
# filter
"""
listの各要素から条件を満たす要素だけを取り出す
filter(条件となる関数, 配列)
list(filter(条件, 配列))
"""
import re

time_list = [
    "2006/11/26_2:40",
    "2009/1/16_23:35",
    "2014/5/4_14:26",
    "2017/8/9_7:5",
    "2017/4/1_22:15"
]

first_harf = lambda x: int(re.split('[/_:]', x)[1]) - 7 < 0
first_harf_list = list(filter(first_harf, time_list))
print(first_harf_list)

['2009/1/16_23:35', '2014/5/4_14:26', '2017/4/1_22:15']

In [14]:
# sorted
"""
リストをソートする
sorted(ソートしたい配列, key=キーとなる関数, reverse=TreuまたはFalse)
key=lambda x: x[n]
    - n要素を昇順にソート
reverse=True
    - 降順
"""
time_data = [
    [2006, 11, 26,  2, 40],
    [2009,  1, 16, 23, 35],
    [2014,  5,  4, 14, 26],
    [2017,  8,  9,  7,  5],
    [2017,  4,  1, 22, 15]
]

sort_by_month = sorted(time_data, key=lambda x: x[3])
print(sort_by_month)

[[2006, 11, 26, 2, 40], [2017, 8, 9, 7, 5], [2014, 5, 4, 14, 26], [2017, 4, 1, 22, 15], [2009, 1, 16, 23, 35]]

In [17]:
# リストの生成
"""
リスト内包表記
    - [適用したい関数(要素) for 要素 in 適用する元の配列]
map
    - イテレータが欲しい時
リスト内包表記
    - 直接配列が欲しい時
"""
minute_data = [30, 155, 180, 74, 11, 60, 82]

split_h_m = lambda x: [x // 60, x % 60]

h_m_data = [split_h_m(x) for x in minute_data]
print(h_m_data)

[[0, 30], [2, 35], [3, 0], [1, 14], [0, 11], [1, 0], [1, 22]]

In [18]:
# if文を用いたループ
"""
後置if
    - [適用したい関数(要素) for 要素 in フィルタリングしたい配列 if 条件]
"""
a = [1, -2, 3, -4, 5]

b = [x for x in a if x > 0]
print(b)

[1, 3, 5]

In [19]:
minute_data = [30, 155, 180, 74, 11, 60, 82]

min_list = [x for x in minute_data if x % 60 == 0]
print(min_list)

[180, 60]

In [20]:
# 複数配列の同時ループ
"""
zip
    - 複数の配列を並列にループさせたい時
"""
a =[1, -2, 3, -4, 5]
b = [9, 8, -7, -6, -5]

for x, y in zip(a, b):
    print(x, y)

1 9
-2 8
3 -7
-4 -6
5 -5

In [22]:
a_and_b = [x**2 + y**2 for x, y in zip(a, b)]
print(a_and_b)

[82, 68, 58, 52, 50]

In [23]:
hour = [0, 2, 3, 1, 0, 1, 1]
minute = [30, 35, 0, 14, 11, 0, 22]

h_m_conbine = lambda x, y: x * 60 + y

h_m_data = [h_m_conbine(x, y) for x, y in zip(hour, minute)]

print(h_m_data)

[30, 155, 180, 74, 11, 60, 82]

In [24]:
# 多重ループ
a =[1, -2, 3]
b = [9, 8]

for x in a:
    for y in b:
        print(x, y)

1 9
1 8
-2 9
-2 8
3 9
3 8

In [25]:
sample = [[x, y] for x in a for y in b]
print(sample)

[[1, 9], [1, 8], [-2, 9], [-2, 8], [3, 9], [3, 8]]

In [27]:
fours_place = [0, 1]
twos_place  = [0, 1]
ones_place  = [0, 1]

digit = [x*4 + y*2 + z for x in fours_place for y in twos_place for z in ones_place]
print(digit)

[0, 1, 2, 3, 4, 5, 6, 7]

In [29]:
# defaultdict
"""
from collections import defaultdict

d = defaultdict(valueの型)
"""
from collections import defaultdict
d = defaultdict(int)
lst = ["foo", "bar", "pop", "pop", "foo", "popo"]
for key in lst:
    d[key] += 1

print(d)

defaultdict(<class 'int'>, {'foo': 2, 'bar': 1, 'pop': 2, 'popo': 1})

In [31]:
from collections import defaultdict

description = \
"Artificial intelligence (AI, also machine intelligence, MI) is " + \
"intelligence exhibited by machines, rather than " + \
"humans or other animals (natural intelligence, NI)."

d = defaultdict(int)

for key in description:
    d[key] += 1
    
print(sorted(d.items(), key=lambda x: x[1], reverse=True)[:10])

[(' ', 20), ('e', 18), ('i', 17), ('n', 14), ('l', 12), ('a', 11), ('t', 10), ('c', 7), ('h', 7), ('r', 6)]

In [33]:
"""
defaultdict(list)
辞書[key].append(要素)
"""
from collections import defaultdict

d ={}
price = [
    ("apple", 50),
    ("banana", 120),
    ("grape", 500),
    ("apple", 70),
    ("lemon", 150),
    ("grape", 1000)
]
for key, value in price:
    if key in d:
        d[key].append(value)
    else:
        d[key] = [value]

print(d)

{'apple': [50, 70], 'banana': [120], 'grape': [500, 1000], 'lemon': [150]}

In [34]:
from collections import defaultdict

price = [
    ("apple", 50),
    ("banana", 120),
    ("grape", 500),
    ("apple", 70),
    ("lemon", 150),
    ("grape", 1000)
]

d = defaultdict(list)

for key, value in price:
    d[key].append(value)

print([sum(x) / len(x) for x in d.values()])

[60.0, 120.0, 750.0, 150.0]

In [35]:
# Counter
"""
要素の数え上げに特化
d = Counter(数えたいデータ)
most_common
    - 要素を頻度の降順にソート
    - 辞書.most_common(取得する要素数)
        - 取得する要素数1とすると最頻を返す
"""
from collections import Counter

lst = ["foo", "bar", "pop", "pop", "foo", "popo"]
d = Counter(lst)

print(d)

Counter({'foo': 2, 'pop': 2, 'bar': 1, 'popo': 1})

In [37]:
from collections import Counter

description = \
"Artificial intelligence (AI, also machine intelligence, MI) is " + \
"intelligence exhibited by machines, rather than " + \
"humans or other animals (natural intelligence, NI)."

d = Counter(description)

print(d.most_common(10))

[(' ', 20), ('e', 18), ('i', 17), ('n', 14), ('l', 12), ('a', 11), ('t', 10), ('c', 7), ('h', 7), ('r', 6)]

In [39]:
import pandas as pd

df = pd.read_csv('http://archive.ics.uci.edu/ml/machine-learning-databases/iris/iris.data', header=None)
df.columns = ["sepal length", "sepal width", "petal length", "petal width", "class"]

df.head()

   sepal length  sepal width  petal length  petal width        class
0           5.1          3.5           1.4          0.2  Iris-setosa
1           4.9          3.0           1.4          0.2  Iris-setosa
2           4.7          3.2           1.3          0.2  Iris-setosa
3           4.6          3.1           1.5          0.2  Iris-setosa
4           5.0          3.6           1.4          0.2  Iris-setosa

In [45]:
import pandas as pd

df = pd.read_csv('company.csv')
df

  company  year president  visitors  pruductA  productB
0  cosme1  2014     James       128     15020     39523
1  cosme1  2015       Tom       102     16102     44127
2  cosme1  2016       Tom       101     15983     48016
3  cosme1  2017     James       116     17240     50974
4  cosme2  2014    Sherry        90     13205     38309
5  cosme2  2015     James       136     14276     42160
6  cosme2  2016    Sherry       101     13198     36756
7  cosme2  2017       Bob       120     16530     38455

In [48]:
import pandas as pd
from pandas import Series, DataFrame

attri_data1 = {"ID": ["100", "101", "102", "103", "104", "106", "108", "110", "111", "113"],
               "city": ["Tokyo", "Osaka", "Kyoto", "Hokkaido", "Tokyo", "Tokyo", "Osaka", "Kyoto", "Hokkaido", "Tokyo"],
               "birth_year": [1990, 1989, 1992, 1997, 1982, 1991, 1988, 1990, 1995, 1981],
               "name": ["Hiroshi", "Akiko", "Yuki", "Satoru", "Steeve", "Mituru", "Aoi", "Tarou", "Suguru", "Mitsuo"]}
attri_data_frame1 = DataFrame(attri_data1)

attri_data2 = {"ID": ["107", "109"],
               "city": ["Sendai", "Nagoya"],
               "birth_year": [1994, 1988]}
attri_data_frame2 = DataFrame(attri_data2)

attri_data_frame1.append(attri_data_frame2).sort_values(by='ID', ascending=True).reset_index(drop=True)

     ID  birth_year      city     name
0   100        1990     Tokyo  Hiroshi
1   101        1989     Osaka    Akiko
2   102        1992     Kyoto     Yuki
3   103        1997  Hokkaido   Satoru
4   104        1982     Tokyo   Steeve
5   106        1991     Tokyo   Mituru
6   107        1994    Sendai      NaN
7   108        1988     Osaka      Aoi
8   109        1988    Nagoya      NaN
9   110        1990     Kyoto    Tarou
10  111        1995  Hokkaido   Suguru
11  113        1981     Tokyo   Mitsuo

In [49]:
# リストワイズ/ペアワイズ削除
import numpy as np
from numpy import nan as NA
import pandas as pd

sample_data_frame = pd.DataFrame(np.random.randn(10, 4))

# わざと欠損を作る
sample_data_frame.iloc[1, 0] = NA
sample_data_frame.iloc[2, 2] = NA
sample_data_frame.iloc[5:, 3] = NA

sample_data_frame

          0         1         2         3
0 -0.432987  1.244547 -0.310293  0.264510
1       NaN -1.122680 -0.358860  0.693517
2 -0.721103 -1.102514       NaN  0.433925
3 -1.233713  0.992370 -1.112389  1.107829
4 -1.563442  0.249730  0.119551 -0.916966
5 -0.414083 -2.082456  0.759448       NaN
6  0.001635 -0.649636 -1.316706       NaN
7  0.063980  0.590095  0.564158       NaN
8  0.039961 -0.604786 -1.420142       NaN
9  0.498102 -0.716765  0.457859       NaN

In [50]:
"""
リストワイズ削除
    - データ欠損のある行を丸ごと削除
"""
sample_data_frame.dropna()

          0         1         2         3
0 -0.432987  1.244547 -0.310293  0.264510
3 -1.233713  0.992370 -1.112389  1.107829
4 -1.563442  0.249730  0.119551 -0.916966

In [52]:
"""
ペアワイズ削除
    - 欠損値の少ない列を残す
"""
sample_data_frame[[0, 1, 2]].dropna()

          0         1         2
0 -0.432987  1.244547 -0.310293
3 -1.233713  0.992370 -1.112389
4 -1.563442  0.249730  0.119551
5 -0.414083 -2.082456  0.759448
6  0.001635 -0.649636 -1.316706
7  0.063980  0.590095  0.564158
8  0.039961 -0.604786 -1.420142
9  0.498102 -0.716765  0.457859